/*2151133 孙韩雅 信07*/
#include <iostream>
#include <iomanip>
#include <cmath> 
using namespace std;

/***************************************************************************
  函数名称：
  功    能：求平方根的函数
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
double root(int a)
{
	double x, y = 0;
	for (x = 1; x < a; x = (x + a / x) / 2) {
		y = (x + a / x) / 2;
		if (fabs(y - x) < 1e-5)
			break;
	}
	return y;
}

/***************************************************************************
  函数名称：
  功    能：重复输入，直到取得int型正整数后返回
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
***************************************************************************/
int input()
{
	int a;
	while (1) {
		cout << "请输入a值" << endl;
		cin >> a;
		if (cin.fail()) {
			cin.clear();
			cin.ignore(65536, '\n');
		}
		else if (a < 0) {
			cin.clear();
			cin.ignore(65536, '\n');
		}
		else
			break;
	}
	return a;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int main()
{
	int a = input();

	/* 此处调用求平方根的函数，函数名、形参、返回值自行设计，函数内不要有任何输出语句 */
	double b=root(a);

	/* 此处输出平方根（语句不全，将后面补齐，最后要输出换行符）*/
	cout << a << "的平方根=" << setiosflags(ios::fixed) << setprecision(3) << b << endl;

	return 0;
}
