/*2151133 孙韩雅 信07*/
#include <iostream>
using namespace std;

/***************************************************************************
  函数名称：
  功    能：输出位数、正序、逆序
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
***************************************************************************/
void output(int k)
{
	int a, b, c, d, e;
	a = (int)k / 10000;
	b = (int)(k - a * 10000) / 1000;
	c = (int)(k - a * 10000 - b * 1000) / 100;
	d = (int)(k - a * 10000 - b * 1000 - c * 100) / 10;
	e = (int)(k - a * 10000 - b * 1000 - c * 100 - d * 10);
	if (a == 0) {
		if (b == 0) {
			if (c == 0) {
				if (d == 0) {
					cout << "1位数" << endl;
				}
				else
					cout << "2位数" << endl;
			}
			else
				cout << "3位数" << endl;
		}
		else
			cout << "4位数" << endl;
	}
	else
		cout << "5位数" << endl;
	cout << "每位数字分别是 : " << endl;
	if (a == 0) {
		if (b == 0) {
			if (c == 0) {
				if (d == 0) {
					cout << e << endl;
				}
				else
					cout << d << " " << e << endl;
			}
			else
				cout << c << " " << d << " " << e << endl;
		}
		else
			cout << b << " " << c << " " << d << " " << e << endl;
	}
	else
		cout << a << " " << b << " " << c << " " << d << " " << e << endl;
	cout << "逆序输出的每位数字分别是 : " << endl;
	if (a == 0) {
		if (b == 0) {
			if (c == 0) {
				if (d == 0) {
					cout << e << endl;
				}
				else
					cout << e << " " << d << endl;
			}
			else
				cout << e << " " << d << " " << c << endl;
		}
		else
			cout << e << " " << d << " " << c << " " << b << endl;
	}
	else
		cout << e << " " << d << " " << c << " " << b << " " << a << endl;
}

/***************************************************************************
  函数名称：
  功    能：重复输入，直到取得[0..99999]之间的整数后返回
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
***************************************************************************/
int input(void)
{
	int i;
	while (1) {
		cout << "请输入一个[0..99999]间的整数" << endl;
		cin >> i;
		if (cin.fail()) {
			cin.clear();
			cin.ignore(65536, '\n');
		}
		else if (i > 99999 || i < 0) {
			cin.clear();
			cin.ignore(65536, '\n');
		}
		else
			break;
	}
	return i;
}


/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动
***************************************************************************/
int main()
{
	int k;

	k = input();
	output(k);

	return 0;
}